
<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>YouCat</title>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/css/bootstrap.min.css" integrity="sha384-T3c6CoIi6uLrA9TneNEoa7RxnatzjcDSCmG1MXxSR1GAsXEV/Dwwykc2MPK8M2HN" crossorigin="anonymous">

    <style>
        .white-div {
            background-color: #ffffff;
            padding: 20px;
            border-radius: 20px;
            margin-top: 20px;
            box-shadow: 0 0 30px rgba(0, 0, 0, 0.1);
            font-size : 22px;
        }

        .uncopyable {
            position: relative;
            user-select: none;
        }

        .uncopyable::before {
            content: '';
            position: absolute;
            top: 0;
            right: 0;
            bottom: 0;
            left: 0;
            background: transparent;
            pointer-events: none; 
        }


    </style>
    
    <link rel = "stylesheet" href = "../css/style.css">
</head>

<body>
   <nav class="navbar navbar-expand-lg bg-body-tertiary text-center  fs-5">
    <div class="container-fluid">
        <a class="navbar-brand" href="../index.php">
            <img src="../icym_25.png" alt="Logo" id="navbar-logo" style="max-height: 100px; max-width: 100px;" onerror="this.onerror=null;this.src='alternative_logo.png';">
        </a>
        <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent"
            aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
        </button>
        <div class="collapse navbar-collapse justify-content-center" id="navbarSupportedContent">
            <ul class="navbar-nav">
                <li class="nav-item">
                    <a class="nav-link active" aria-current="page" href="../index.php">Home</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="../posts/">Posts</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="#">YouCat</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="../news/">Daily News</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="../calendar/">Coming Events Calendar</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="../jobs/">Job Offers</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="../magazines/">Magazines</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="../gallery/">Gallery</a>
                </li>
            </ul>
        </div>
    </div>
</nav>




    <div class="container uncopyable" style = "margin-top : 170px">
        <div class="row justify-content-center">
            
                <div class="white-div">
                    <h1  class="text-center mb-5" style = "text-decoration : underline " >Youth Catechism</h1>
                    <p>

1 . આપણે અહીં પૃથ્વી પર શા માટે છીએ?
આપણે અહીં પૃથ્વી પર ઈશ્વરને જાણવા, પ્રેમ કરવા, તેમની ઇચ્છા મુજબ ભલા કાર્યો કરવા અને જીવન ના અંતે સ્વર્ગગમન કરવા માટે છીએ.
માણસ બનવું એટલે ઈશ્વર તરફથી આવવું અને ઈશ્વર પાસે પરત જવું. આપણું મૂળ આપણા માતા-પિતા કરતાં વધુ પાછળ જાય છે. આપણે ઈશ્વર તરફથી આવ્યા છીએ, જેમનામાં સ્વર્ગ અને પૃથ્વીનો સઘળો આનંદ સમાઈ જાય છે ઉપરાંત આપણે તેમના શાશ્વત, અનંત આશીર્વાદની અપેક્ષા રાખીએ છીએ. દરમિયાન, આપણે આ પૃથ્વી પર રહીએ છીએ ત્યારે ક્યારેક આપણને લાગે છે કે આપણો સર્જક નજીક છે; ઘણી વાર આપણને કશું જ લાગતું નથી. આપણે આપણા ઘરનો રસ્તો શોધી શકીએ, ઈશ્વરે આપણને તેના પુત્રને મોકલ્યો, જેણે આપણને પાપમાંથી મુક્ત કર્યા, આપણને બધી દુષ્ટતાથી બચાવ્યા, અને જે ખચિત આપણને સાચા જીવનમાં દોરી જાય છે. તે "માર્ગ, સત્ય અને જીવન" છે (યોહાન 14:6)
<br>
<br>
2 . ઈશ્વરે આપણને શા માટે બનાવ્યા?
ઈશ્વરે આપણને મુક્ત અને નિઃસ્વાર્થ પ્રેમથી બનાવ્યા છે.
જ્યારે કોઈ માણસ પ્રેમ કરે છે, ત્યારે તેનું હૃદય છલકાઈ જાય છે. તે પોતાનો આનંદ બીજાઓ સાથે વહેંચવા માંગે છે. તે તેના સર્જક પાસેથી આ મેળવે છે. ઈશ્વર એક રહસ્ય હોવા છતાં, આપણે હજી પણ તેના વિશે માનવીય રીતે વિચારી શકીએ છીએ અને કહી શકીએ છીએ: તેના પ્રેમના "વધારા"માંથી તેણે આપણને બનાવ્યા છે. તે તેનો અનંત આનંદ આપણી સાથે વહેંચવા માંગતો હતો, જેઓ તેના પ્રેમની પ્રતિકૃતિઓ છે.
<br>
<br>
3 . આપણે ઈશ્વરને શા માટે શોધીએ છીએ?
ઈશ્વરે આપણા હૃદયમાં તેને શોધવાની ઝંખના મૂકી છે.
સંત ઓગસ્ટિન કહે છે, "તમે અમને તમારા માટે બનાવ્યા છે, અને જ્યાં સુધી તે તમારામાં ન રહે ત્યાં સુધી અમારું હૃદય અશાંત છે." આને આપણે ઈશ્વરની ઝંખના કહીએ છીએ.
માણસ ઈશ્વરને શોધે એ સ્વાભાવિક છે. સત્ય અને પ્રસન્નતા માટેના આપણા બધા પ્રયત્નો આખરે એવા વ્યક્તિની શોધ છે જે આપણને સંપૂર્ણ ટેકો આપે છે, આપણને સંપૂર્ણ સંતોષ આપે છે અને તેની સેવામાં આપણને સંપૂર્ણપણે કામે લગાડે છે. જ્યાં સુધી તેને ઈશ્વર ન મળે ત્યાં સુધી વ્યક્તિ સંપૂર્ણ બનતો નથી. "કોઈપણ વ્યક્તિ કે જે સત્યની શોધમાં છે તે ઈશ્વરને શોધે છે, પછી ભલે તેને તે વિષે ખ્યાલ હોય કે નહિ" (સેન્ટ.એડિથ સ્ટેઈન)
<br>
<br>
4 . શું આપણે આપણા કારણથી ઈશ્વરના અસ્તિત્વને જાણી શકીએ છીએ?
હા. માનવ કારણ ઈશ્વરને નિશ્ચિતપણે જાણી શકે છે.
જગતનું મૂળ અને તેનું લક્ષ્ય પોતાની અંદર ન હોઈ શકે. અસ્તિત્વમાં છે તે દરેક વસ્તુમાં, આપણે જોઈએ છીએ તેના કરતાં વધુ છે. ક્રમ, સુંદરતા, અને વિશ્વનો વિકાસ પોતાને પરમાત્મા તરફ નિર્દેશ કરે છે. દરેક માણસ જે સાચું, સારું અને સુંદર છે તેને સ્વીકારે છે. તે પોતાના અંતરઅંતરાત્માનો અવાજ સાંભળે છે, જે તેને જે સારું છે તે માટે વિનંતી કરે છે અને જે ખરાબ છે તેની સામે ચેતવણી આપે છે. જે કોઈ આ માર્ગને અનુસરે છે તે વ્યાજબી રીતે ઈશ્વરને શોધે છે.
<br>
<br>
5 . જો લોકો તેને કારણથી ઓળખી શકે તો ઈશ્વર અસ્તિત્વમાં છે તેનો લોકો શા માટે નકાર કરે છે?
અદ્રશ્ય ઈશ્વરને જાણવો એ માનવ મન માટે એક મોટો પડકાર છે. ઘણા તેનાથી ડરી ગયા છે. અમુક લોકો ઈશ્વરને જાણવા માંગતા નથી તેનું બીજું કારણ એ છે કે પછી તેઓએ પોતાનું જીવન બદલવું પડશે. કોઈપણ વ્યકી જે એમ કહે છે કે ઈશ્વર વિશેનો પ્રશ્ન અર્થહીન છે કારણ કે તેનો જવાબ આપી શકાતો નથી તે પોતાની જ સ્વેચ્છાઓના પ્રાધાન્યને માટે સઘળું આસાન કરી દે છે.
<br>
<br>
6 . શું આપણે ઈશ્વરને ખ્યાલોમાં જરા પણ સમજી શકીએ છીએ? શું તેના વિશે અર્થપૂર્ણ રીતે બોલવું શક્ય છે?
જો કે આપણે મનુષ્યો મર્યાદિત છીએ અને ઈશ્વરની અનંત મહાનતા ક્યારેય મર્યાદિત માનવ ખ્યાલોમાં બંધબેસતી નથી, તેમ છતાં આપણે ઈશ્વર વિશે યોગ્ય રીતે બોલી શકીએ છીએ.
ઈશ્વર વિશે કંઈક વ્યક્ત કરવા માટે, આપણે અપૂર્ણ છબીઓ અને મર્યાદિત કલ્પનાઓનો ઉપયોગ કરીએ છીએ. અને તેથી ઈશ્વર વિશે આપણે જે કંઈ કહીએ છીએ તે આપણી એક અનામત સીમિત ભાષા માત્ર છે જે ઈશ્વરની મહાનતા ને આંબવા પૂરતી નથી. તેથી આપણે ઈશ્વર વિશેની આપણી વાણીને સતત શુદ્ધ રાખવી અને સુધારવી જોઈએ.
<br>
<br>
7 . ઈશ્વર કેવો છે તે આપણે જાણી શકીએ એ માટે ઈશ્વરે શા માટે પોતાને બતાવવાની જરૂર હતી?
માણસ કારણથી જાણી શકે છે કે ઈશ્વરનું છે, પરંતુ ઈશ્વર ખરેખર કેવા છે તે કોઈ જાણતું નથી. તેમ છતાં, કારણ કે ભગવાન ખૂબ જ ઓળખવા માંગે છે, તેણે પોતાની જાતને જાહેર કરી છે.
ઈશ્વરે આપણને પોતાને પ્રગટ કરવાની જરૂર નહોતી. પરંતુ તેણે તે કર્યું - પ્રેમથી. જેમ માનવીય પ્રેમમાં કોઈ પ્રિય વ્યક્તિ આપણા માટે તેનું હૃદય ખોલે તો જ તેના વિશે કંઈક જાણી શકે છે, તેવી જ રીતે આપણે પણ ઈશ્વરના આંતરિક વિચારો વિશે કંઈક જાણીએ છીએ કારણ કે શાશ્વત અને રહસ્યમય ઈશ્વરને પોતાને પ્રેમથી આપણા માટે ખોલ્યો છે. સર્જનથી લઈને, પિતૃઓ અને પ્રબોધકો દ્વારા તેમના પુત્ર ઈસુ ખ્રિસ્તમાં→ પ્રકટીકરણ સુધી, ઈશ્વર માનવજાત સાથે વારંવાર બોલ્યા છે. એમ કરીને તેમણે તેમનું હૃદય આપણા માટે ઠાલવ્યું છે અને તેનું અંતર આપણા માટે દૃશ્યમાન કર્યું છે.
<br>
<br>
8 . જૂના કરારમાં ઈશ્વર પોતાને કેવી રીતે પ્રગટ કરે છે?
ઈશ્વર → જૂના કરારમાં પોતાને ઈશ્વર તરીકે બતાવે છે, જેમણે પ્રેમથી વિશ્વનું સર્જન કર્યું અને જ્યારે તેમનો પ્રેમ માણસજાત પાપમાં પડી છતાં અચળ રહ્યો.
ઈશ્વર ઇતિહાસમાં સ્વયં નો અનુભવ અપાવવાની ઘટનાઓ ઘડે છે: નુહ સાથે તે તમામ જીવંત વસ્તુઓને બચાવવા માટે કરાર સ્થાપિત કરે છે. તે ઈબ્રાહીમને "ઘણી દેશ જાતિઓનો પિતા" (ઉત્પતિ 17:5) થવા અને તેમનામાં "પૃથ્વીના સઘળા કુટુંબો" ને આશીર્વાદ આપવા (ઉત્પતિ 12:3) બોલાવે છે. ઇઝરાયેલ લોકો, ઈબ્રાહીમથી ઉછરેલા, તેમના વિશેષ બની જાય છે. મુસાને તે નામથી પોતાનો પરિચય આપે છે. તેમનું રહસ્યમય નામ יהוה → YHWH, જે સામાન્ય રીતે Yahweh તરીકે લખવામાં આવે છે, જેનો અર્થ થાય છે "હું જે છું તે હું છું" (નિર્ગમન 3:14). તે ઇઝરાયેલને મિસરની ગુલામીમાંથી મુક્ત કરે છે, સિનાઇ પર તેમની સાથે કરાર સ્થાપિત કરે છે, અને મૂસા દ્વારા તેમને નિયમસંહિતા આપે છે. લોકોને પોતાની ગમ પાછા લાવવા ઈશ્વર વારંવાર પ્રબોધકોને મોકલે છે. પ્રબોધકો ઘોષણા કરે છે કે ઈશ્વર એક નવો અને શાશ્વત કરાર સ્થાપિત કરશે, જે આમૂલ નવીકરણ અને નિશ્ચિત મુક્તિ લાવશે. આ કરાર તમામ મનુષ્યો માટે ખુલ્લો રહેશે.
<br>
<br>
9 . જ્યારે ઈશ્વર પોતાના પુત્રને આપણી પાસે મોકલે છે ત્યારે પોતાના વિશે આપણને શું બતાવે છે?
ઈશ્વર આપણને ઈસુ ખ્રિસ્તમાં તેના દયાવાન પ્રેમની સંપૂર્ણ ઊંડાઈ બતાવે છે.
ઈસુ ખ્રિસ્ત દ્વારા અદૃશ્ય ઈશ્વર દૃશ્યમાન બને છે. તે આપણા જેવો માણસ બની જાય છે. આ આપણને બતાવે છે કે ઈશ્વરનો પ્રેમ કેટલો અસીમિત: તે આપણો સંપૂર્ણ બોજ ઉઠાવે છે. તે આપણી સાથે દરેક પંથે ચાલે છે. તે આપણા ત્યાગમાં, આપણી વેદનાઓમાં, મૃત્યુના ભયમાં છે. તે ત્યાં છે જ્યાં આપણે વધુ દૂર જઈ શકતા નથી, જેથી આપણા માટે જીવન તરફ દોરી જતા દરવાજા ખોલી શકે.
આ તેમનું [ધર્મશાસ્ત્રીનું] ધ્યેય છે: આપણા જમાનાની અને અન્ય સમયે, શબ્દોની વિપુલતામાં, જરૂરી શબ્દો સાંભળવા માટે. શબ્દો દ્વારા, તેનો અર્થ એ છે કે શબ્દ, શબ્દ જે ઈશ્વર તરફથી આવે છે, તે શબ્દ જે સ્વયં ઈશ્વર છે તેને રજૂ કરે છે. પોપ બેનેડિક્ટ સોળમા દ્વારા, ઑક્ટોબર 6, 2006 ના રોજ ઈશ્વર વિશે જે કહેવામાં આવ્યું તે સ્વયં ઈશ્વર દ્વારા વ્યાખ્યાયિત કરવામાં આવ્યું તેવું અનુમાન છે. એસ.ટી. એડીથ સ્ટેઈન (1891-1942, યહૂદી ખ્રિસ્તી, ફિલોસોફર, અને કાર્મેલાઇટ સાધ્વી, હિટલરના concentration camp ની પીડિતા) ઈસુ ખ્રિસ્તમાં, ઈશ્વરે માનવ મુખાકૃતિ લીધી અને આપણા મિત્ર અને ભાઈ બન્યા. પોપ બેનેડિક્ટ XVI, સપ્ટેમ્બર 6, 2006.
<br>
<br>
10 . ઈસુ ખ્રિસ્ત સાથે, શું બધું જ કહેવામાં આવ્યું છે, અથવા તેમના પછી પણ પ્રકટીકરણ ચાલુ રહે છે?
ઈસુ ખ્રિસ્તમાં, ઈશ્વર પોતે પૃથ્વી પર આવ્યા. તે ઈશ્વરનો અંતિમ શબ્દ છે. તેને સાંભળીને, દરેક સમયના બધા માણસો જાણી શકે છે કે ઈશ્વર કોણ છે અને તેમની મુક્તિ માટે શું જરૂરી છે.
ઈસુ ખ્રિસ્તની સુવાર્તા સાથે, → ઈશ્વરનો સાક્ષાત્કાર સંપૂર્ણ છે. તે આપણા માટે સમજી શકાય તેવું બનાવવા માટે, પવિત્ર આત્મા આપણને સત્યમાં વધુ ઊંડે લઈ જાય છે. ઈશ્વરનો પ્રકાશ એટલો બળપૂર્વક ઘણા વ્યક્તિઓના જીવનમાં તૂટી જાય છે કે તેઓ "સ્વર્ગ ખુલ્લું જુએ છે" (પ્રેરિતોનાં કૃત્યો 7:56). આ રીતે મેક્સિકોમાં ગ્વાડાલુપે અથવા ફ્રાન્સમાં લોર્ડેસ જેવા મહાન તીર્થસ્થાનો આવ્યા. દાર્શનીકોના "અંગત સાક્ષાત્કારો" ઈસુ ખ્રિસ્તની સુવાર્તા થકી માત્ર સુધરી શકતા નથી. તેમનામાં વિશ્વાસ રાખવા માટે કોઈ બંધાયેલું નથી. પરંતુ તેઓ સુવાર્તાને વધુ સારી રીતે સમજવામાં મદદ કરી શકે છે. તેમની અધિકૃતતા →ચર્ચ (મંડળી) દ્વારા ચકાસવામાં આવે છે
<br>

    </p>
                </div>
            </div>
        </div>
    </div>

   

    <!-- Your translation functions here -->
    <script>
        function toggleLanguage(language) {
            if (language === 'english') {
                document.getElementById('english-verses').style.display = 'block';
                document.getElementById('gujarati-verses').style.display = 'none';
            } else if (language === 'gujarati') {
                document.getElementById('english-verses').style.display = 'none';
                document.getElementById('gujarati-verses').style.display = 'block';
            }
        }
    </script>

<script defer src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/js/bootstrap.bundle.min.js" integrity="sha384-C6RzsynM9kWDrMNeT87bh95OGNyZPhcTNXj1NW7RuBCsyN/o0jlpcV8Qyq46cDfL" crossorigin="anonymous"></script>
    
</body>

</html>
